Merge remote-tracking branch 'origin/main' into ux-a11y-language-selector-15290004198733052982
# Conflicts:
#	frontend/src/components/layout/LanguageSelector.tsx
